doc/slides/slide_amitie_surcharge.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Amitié &amp; Surcharge d&rsquo;opérateur</title>
<!-- 2013-10-19 sam. 16:16 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" href="../stylesheets/styles.css">
                 <link rel="stylesheet" href="../stylesheets/org-pygments.css">
</head>
<body>
<div id="preamble" class="status">
</a><a href="slide_compilation.html">Compilation & Directives de préprocesseur </a><a href="slide_pointeur.html">Pointeurs, Références & Allocation Dynamique de Mémoire </a><a href="slide_specificite_c++.html">Spécificités du C++ (indépendantes de la POO) </a><a href="slide_struct_class.html">Structures & Classes </a><aa>Encapsulation des données </aa><aa>Constructeur & Destructeur de classe </aa><aa>Amitié & Surcharge d'opérateur </aa><aa>Héritage (Partie 1) </aa><aa>Héritage (Partie 2) </aa><aa>Patrons de fonctions et de classes </aa><aa>Introduction à la librairie standard </aa>
                     <hr/>
                     <a href="../index.html">Retour menu principal</a>
</div>
<div id="content">
<h1 class="title">Amitié &amp; Surcharge d&rsquo;opérateur</h1><hr/>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Fonctions et classes amies</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Du fait du principe d&rsquo;encapsulation des données, les fonctions extérieures à
la classe n&rsquo;ont pas accès aux membres privées de cette classe&#x2026;
</li>

<li>&#x2026; à l&rsquo;exception des fonctions amies
</li>

<li>Utilité : quasi nulle sauf pour quelques opérations (dont la surcharge
d&rsquo;opérateur)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Exemple de fonction amie d&rsquo;une classe</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-comment-delimiter">// </span><span class="org-comment">D&#233;claration avec friend</span>
<span class="org-keyword">class</span> <span class="org-type">particule</span>
{
  <span class="org-keyword">friend</span> <span class="org-type">void</span> <span class="org-function-name">stupid_thing</span> (<span class="org-type">particule</span> &amp; <span class="org-variable-name">particule_</span>);
  ...
};
...
<span class="org-comment-delimiter">// </span><span class="org-comment">D&#233;finition</span>
<span class="org-type">void</span> stupid_thing (particule &amp; particule_)
{
  particule_.m_mass = 0.511;
}
...
<span class="org-comment-delimiter">// </span><span class="org-comment">Utilisation</span>
<span class="org-type">int</span> main ()
{
  <span class="org-type">particule</span> <span class="org-variable-name">my_muon</span> (105.6, -1.6e-19);
  stupid_thing (my_muon);
  <span class="org-comment-delimiter">// </span><span class="org-comment">muon $\equiv$ &#233;lectron ?? wtf !!</span>
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Classe amie d&rsquo;une autre classe</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Méthode d&rsquo;une classe <code>B</code>, amie d&rsquo;une autre classe <code>A</code>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">class</span> <span class="org-type">A</span>
{
  ...
  <span class="org-keyword">friend</span> <span class="org-type">void</span> <span class="org-constant">B</span>::methode_de_B (<span class="org-type">A</span> &amp; <span class="org-variable-name">A_</span>);
  ...
};
</pre>
</div>
</li>

<li>Classe <code>B</code> amie d&rsquo;une autre classe <code>A</code>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">class</span> <span class="org-type">A</span>
{
  ...
  <span class="org-keyword">friend</span> <span class="org-keyword">class</span> <span class="org-type">B</span>;
  ...
};
</pre>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Surcharge d&rsquo;opérateur</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>C++ permet de <b>surdéfinir les opérateurs</b> tels que <code>=</code>, <code>+=</code>, <code>++</code>, <code>&lt;&lt;</code>,
  <code>new</code>&#x2026;
</li>

<li>Fondamentalement, l&rsquo;appel à un opérateur est identique à l&rsquo;appel d&rsquo;une
fonction <b>&rarr; possibilité de surdéfinir</b>
</li>

<li>Le but est de définir ces &ldquo;fonctions&rdquo; pour des classes dépourvues de ces
opérateurs
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Exemple de surcharge de l&rsquo;opérateur unaire <code>+=</code></h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-comment-delimiter">// </span><span class="org-comment">D&#233;claration</span>
<span class="org-keyword">class</span> <span class="org-type">point</span>
{
<span class="org-keyword">public</span>:
  <span class="org-type">point</span> &amp; <span class="org-keyword">operator</span><span class="org-function-name">+=</span> (<span class="org-keyword">const</span> <span class="org-type">point</span> &amp; <span class="org-variable-name">point_</span>);

<span class="org-keyword">private</span>:
  <span class="org-type">double</span> <span class="org-variable-name">m_x</span>;
  <span class="org-type">double</span> <span class="org-variable-name">m_y</span>;
};
</pre>
</div>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-comment-delimiter">// </span><span class="org-comment">D&#233;finition</span>
<span class="org-type">point</span> &amp; <span class="org-constant">point</span>::<span class="org-keyword">operator</span><span class="org-function-name">+=</span> (<span class="org-keyword">const</span> <span class="org-type">point</span> &amp; <span class="org-variable-name">point_</span>)
{
  m_x += point_.m_x;
  m_y += point_.m_y;
  <span class="org-keyword">return</span> *<span class="org-keyword">this</span>;
}
</pre>
</div>

<div class="center">
<p>
<b>&rarr; utilisation du pointeur <code>this</code> qui retourne</b> <br  />
<b>l&rsquo;adresse de l&rsquo;objet courant</b>
</p>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Exemple de surcharge de l&rsquo;opérateur unaire <code>+=</code></h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-comment-delimiter">// </span><span class="org-comment">D&#233;finition</span>
<span class="org-type">point</span> &amp; <span class="org-constant">point</span>::<span class="org-keyword">operator</span><span class="org-function-name">+=</span> (<span class="org-keyword">const</span> <span class="org-type">point</span> &amp; <span class="org-variable-name">point_</span>)
{
  m_x += point_.m_x;
  m_y += point_.m_y;
  <span class="org-keyword">return</span> *<span class="org-keyword">this</span>;
}
...
<span class="org-comment-delimiter">// </span><span class="org-comment">Utilisation</span>
<span class="org-type">int</span> main ()
{
  <span class="org-type">point</span> <span class="org-variable-name">my_point1</span> (2, 3);
  <span class="org-type">point</span> <span class="org-variable-name">my_point2</span> (4, 5);
  my_point1 += my_point2;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Exemple de surcharge de l&rsquo;opérateur binaire <code>+</code></h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-comment-delimiter">// </span><span class="org-comment">D&#233;claration</span>
<span class="org-keyword">class</span> <span class="org-type">point</span>
{
<span class="org-keyword">public</span>:
  <span class="org-keyword">friend</span> <span class="org-type">point</span> <span class="org-keyword">operator</span><span class="org-function-name">+</span> (<span class="org-keyword">const</span> <span class="org-type">point</span> &amp; <span class="org-variable-name">point1_</span>, <span class="org-keyword">const</span> <span class="org-type">point</span> &amp; <span class="org-variable-name">point2_</span>);
  <span class="org-comment-delimiter">// </span><span class="org-comment">Constructeur</span>
  <span class="org-function-name">point</span> (<span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">x_</span>, <span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">a_y_</span>);
};

<span class="org-comment-delimiter">// </span><span class="org-comment">D&#233;finition</span>
<span class="org-type">point</span> <span class="org-keyword">operator</span><span class="org-function-name">+</span> (<span class="org-keyword">const</span> <span class="org-type">point</span> &amp; <span class="org-variable-name">point1_</span>, <span class="org-keyword">const</span> <span class="org-type">point</span> &amp; <span class="org-variable-name">point2_</span>)
{
  <span class="org-keyword">return</span> point (point1_.m_x + point2_.m_x, point1_.m_y + point2_.m_y);
}

<span class="org-type">point</span> <span class="org-function-name">my_point1</span> (2, 3);
<span class="org-type">point</span> <span class="org-function-name">my_point2</span> (4, 5);
<span class="org-type">point</span> <span class="org-variable-name">my_point3</span> = my_point1 + my_point2;
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">Constructeur de recopie et opérateur d&rsquo;affectation <code>=</code></h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>La surcharge de l&rsquo;opérateur d&rsquo;affectation <code>=</code> se fait comme pour n&rsquo;importe
quel opérateur

<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">class</span> <span class="org-type">point</span>
{
  <span class="org-type">point</span> &amp; <span class="org-keyword">operator</span><span class="org-function-name">=</span> (<span class="org-keyword">const</span> <span class="org-type">point</span> &amp; <span class="org-variable-name">point_</span>);
};

<span class="org-type">point</span> &amp; <span class="org-constant">point</span>::<span class="org-keyword">operator</span><span class="org-function-name">=</span> (<span class="org-keyword">const</span> <span class="org-type">point</span> &amp; <span class="org-variable-name">point_</span>)
{
  <span class="org-keyword">if</span> (&amp;point_ != <span class="org-keyword">this</span>)
    {
      m_x = point_.m_x;
      m_y = point_.m_y;
    }
  <span class="org-keyword">return</span> *<span class="org-keyword">this</span>;
}

<span class="org-type">point</span> <span class="org-function-name">my_point1</span> (2, 3);
<span class="org-type">point</span> <span class="org-function-name">my_point2</span> (3, 4);
my_point2 = my_point1;
</pre>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">Constructeur de recopie et opérateur d&rsquo;affectation <code>=</code></h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li>Le constructeur de recopie est la méthode appelée lors de la copie d&rsquo;un objet
vers un autre objet du même type

<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">class</span> <span class="org-type">point</span>
{
  <span class="org-function-name">point</span> (<span class="org-keyword">const</span> <span class="org-type">point</span> &amp; <span class="org-variable-name">point_</span>);
};

<span class="org-constant">point</span>::<span class="org-function-name">point</span> (<span class="org-keyword">const</span> <span class="org-type">point</span> &amp; <span class="org-variable-name">point_</span>)
{
  m_x = point_.m_x;
  m_y = point_.m_y;
}

<span class="org-type">point</span> <span class="org-function-name">my_point1</span> (2, 3);
<span class="org-type">point</span> <span class="org-variable-name">my_point2</span> = my_point1;
</pre>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">Constructeur de recopie et opérateur d&rsquo;affectation <code>=</code></h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li>C++ fournit par défaut le constructeur par recopie et l&rsquo;opérateur
d&rsquo;affectation <code>=</code> (de même pour le constructeur et le destructeur)
</li>

<li>Leur surdéfinition devient indispensable dès lors qu&rsquo;<b>un membre est un
pointeur</b> afin de copier non pas l&rsquo;adresse du pointeur mais sa valeur

<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">double</span> * <span class="org-variable-name">vx</span> = <span class="org-keyword">new</span> <span class="org-type">double</span>[10];
<span class="org-comment-delimiter">// </span><span class="org-comment">Copie du pointeur et non de la valeur point&#233;e</span>
<span class="org-type">double</span> * <span class="org-variable-name">vy</span> = vx;
<span class="org-comment-delimiter">// </span><span class="org-comment">vy n'existe plus</span>
<span class="org-keyword">delete</span>[] vx;
</pre>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11">Constructeur de recopie et opérateur d&rsquo;affectation <code>=</code></h2>
<div class="outline-text-2" id="text-11">
<ul class="org-ul">
<li>C++ fournit par défaut le constructeur par recopie et l&rsquo;opérateur
d&rsquo;affectation <code>=</code> (de même pour le constructeur et le destructeur)
</li>

<li>Leur surdéfinition devient indispensable dès lors qu&rsquo;<b>un membre est un
pointeur</b> afin de copier non pas l&rsquo;adresse du pointeur mais sa valeur

<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">double</span> * <span class="org-variable-name">vx</span> = <span class="org-keyword">new</span> <span class="org-type">double</span>[10];
<span class="org-type">double</span> * <span class="org-variable-name">vy</span> = <span class="org-keyword">new</span> <span class="org-type">double</span>[10];
<span class="org-comment-delimiter">// </span><span class="org-comment">Copie des valeurs</span>
<span class="org-keyword">for</span> (<span class="org-type">size_t</span> <span class="org-variable-name">i</span> = 0; i &lt; 10; ++i) vy[i] = vx[i];
<span class="org-comment-delimiter">// </span><span class="org-comment">vy est toujours pr&#233;sent en m&#233;moire</span>
<span class="org-keyword">delete</span> vx;
</pre>
</div>
</li>
</ul>
</div>
</div>
</div>
</body>
</html>
